      *************DOCUMENTAÇÃO*****************************************
      ******************************************************************
      * Author: LÁZARO V.A. SANTOS
      * Date:09-14-2019
      * Purpose: Treinanmento de COBOL
      * Tectonics: cobc
      ******************************************************************
      *********************************FIM***DOCUMENTAÇÃO***************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG0001.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
