
      *----------------------------------------------------------------*
       IDENTIFICATION                          DIVISION.
      *================================================================*

       PROGRAM-ID. PROG0001.
       AUTHOR. LAZARO VINICIUS A. SANTOS

      *************DOCUMENTACAO*****************************************
      ******************************************************************
      * Author: LÁZARO V.A. SANTOS
      * Date:09-14-2019
      * Purpose: Treinanmento de COBOL
      * Tectonics: cobc
      ******************************************************************
      *********************************FIM***DOCUMENTACAO***************
      *================================================================*
       ENVIRONMENT DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       CONFIGURATION SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.

      *----------------------------------------------------------------*
       INPUT-OUTPUT SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.

      *================================================================*
       DATA DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       FILE SECTION.
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------*

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
