      ******************************************************************
      * Author: LÁZARO V.A. SANTOS
      * Date: 14-09-2019
      * Purpose: Sistema de pastelaria
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SGP001.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM SGP001.
